app/controllers/sessions_controller.rb

  def create
    user = User.find_by(login: params[:session][:login].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."login" = $1 LIMIT $2  [["login", "darkkgreen"], ["LIMIT", 1]]