app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save(user_params)
---
INSERT INTO "users" ("name", "login", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    @user = nil if @user.destroy do
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 8]]

  def update
    @user = User.find(params[:id])
    if @user == @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Henrique Eigara"], ["updated_at", "2018-03-19 13:41:02.294621"], ["id", 17]]